src/InformationRegisters/СостоянияЗаказовНаПроизводство/СостоянияЗаказовНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказовНаПроизводство</name>
  <resources>
    <name>СостояниеЭтапов</name>
    <type>
      <types>EnumRef.СостоянияЗаказовНаПроизводствоВОчереди</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеОбеспечения</name>
    <type>
      <types>EnumRef.СостоянияЗаказовНаПроизводствоВОчереди</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеВыпуска</name>
    <type>
      <types>EnumRef.СостоянияЗаказовНаПроизводствоВОчереди</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ГрафикЭтаповПроизводства2_2/ГрафикЭтаповПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикЭтаповПроизводства2_2</name>
  <resources>
    <name>НачалоЭтапа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОкончаниеЭтапа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОкончаниеПредварительногоБуфера</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НачалоЗавершающегоБуфера</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НачалоСледующегоЭтапа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НаКритическомПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОграничиваетСрокВыпуска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОграниченПоМатериалам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОграниченПоОборудованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>РазмещениеВыпуска</name>
    <type>
      <types>EnumRef.СпособыПривязкиОперацийПроизводства</types>
    </type>
  </attributes>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусГрафика</name>
    <comment>Служебный реквизит. Статус 0 - рабочий (&quot;боевой&quot;) график; статус 1 - предварительный график (рассчитан но не сохранен); статус 2 - модель графика.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПроизводства</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ЗаказНаПроизводство2_2/ЗаказНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаПроизводство2_2</name>
  <registerRecords>InformationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccumulationRegister.ОбеспечениеПроизводственныхПроцессов</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Очередь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
        <scale>15</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПодДеятельность</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ЗаказДавальца2_5</types>
      <types>DocumentRef.ЗаказНаРемонт</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ЗаказДавальца</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмещениеВыпуска</name>
    <type>
      <types>EnumRef.СпособыПривязкиОперацийПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НачатьНеРанее</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПродукция</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбособления</name>
    <type>
      <types>EnumRef.ВариантыОбособленияМатериаловВПроизводстве</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорНеОбязателен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроизводственногоПроцесса</name>
    <type>
      <types>EnumRef.ТипыПроизводственныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределенияЗатратНаВыходныеИзделия</name>
    <type>
      <types>EnumRef.СпособыРаспределенияЗатратНаВыходныеИзделия</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособлениеПолуфабрикатовПоНазначениюЭтаповНеИспользуется</name>
    <comment>Служебный реквизит для поддержки перехода с предыдущих версий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказовНаПроизводство2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартияПроизводства</name>
    <type>
      <types>CatalogRef.ПартииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеОбеспечениеМатериаловИРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическаяСтруктура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УкрупненныйЗаказПоНазначениямПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <comment>Уникальный идентификатор ссылки</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторСтрока</name>
    <comment>Уникальный идентификатор ссылки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.РесурсныеСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <type>
        <types>CatalogRef.ПричиныОтменыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимостиНаЕдиницу</name>
      <comment>Служебный реквизит для автоматического заполнения доли стоимости</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписатьНаРасходы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <type>
        <types>Characteristic.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючНоменклатура</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/СостоянияЗаказовНаПроизводство/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Рассчитывает и записывает состояния заказов на производство.
//
// Параметры:
//  Заказы - ДокументСсылка.ЗаказНаПроизводство2_2, Массив - набор заказов.
//
Процедура ОтразитьСостояние(Заказы) Экспорт
	
	МассивСсылок = УправлениеПроизводствомКлиентСервер.МассивЗначений(Заказы);
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = ВыборкаИзменений(МассивСсылок);
	ЗаписатьСостояния(Выборка);
	
КонецПроцедуры

// Очищает состояния заказов на производство.
//
// Параметры:
//  Заказы - ДокументСсылка.ЗаказНаПроизводство2_2, Массив - набор заказов.
//
Процедура ОчиститьСостояние(Заказы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивСсылок = УправлениеПроизводствомКлиентСервер.МассивЗначений(Заказы);
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Ссылка Из МассивСсылок Цикл
		Набор = РегистрыСведений.СостоянияЗаказовНаПроизводство.СоздатьНаборЗаписей();
		Набор.Отбор.Заказ.Установить(Ссылка);
		Набор.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Функция ТекстЗапросаВТСостоянияЭтапов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Таблица.Ссылка             КАК Ссылка,
		|	ВЫБОР
		|		КОГДА Таблица.КодСостояния = 1
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповНаМежцеховомУровне.ТребуетУточнения)
		|		КОГДА Таблица.КодСостояния = 2
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповНаМежцеховомУровне.ГотовКВыполнению)
		|	КОНЕЦ                      КАК СостояниеНаМежцеховомУровне,
		|	Таблица.ТребуетОбеспечения КАК ТребуетОбеспечения
		|ПОМЕСТИТЬ ВТСостоянияЭтапов
		|ИЗ
		|	(ВЫБРАТЬ
		|		Таблица.Распоряжение КАК Ссылка,
		|		МИНИМУМ(ВЫБОР
		|				КОГДА Таблица.СостояниеНаМежцеховомУровне = ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповНаМежцеховомУровне.ТребуетУточнения)
		|					ТОГДА 1
		|				КОГДА Таблица.СостояниеНаМежцеховомУровне = ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповНаМежцеховомУровне.ГотовКВыполнению)
		|					ТОГДА 2
		|				ИНАЧЕ 3
		|			КОНЕЦ) КАК КодСостояния,
		|		МАКСИМУМ(Таблица.ТребуетОбеспечения) КАК ТребуетОбеспечения
		|	ИЗ
		|		РегистрСведений.СостоянияЭтаповПроизводства КАК Таблица
		|	ГДЕ
		|		Таблица.Распоряжение В(&МассивСсылок)
		|		И (Таблица.СостояниеНаМежцеховомУровне В (ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповНаМежцеховомУровне.ТребуетУточнения),
		|													ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповНаМежцеховомУровне.ГотовКВыполнению))
		|				ИЛИ Таблица.ТребуетОбеспечения)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Таблица.Распоряжение) КАК Таблица";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТТребуетсяСформироватьЭтапы()
	
	ТекстЗапроса = Документы.ЗаказНаПроизводство2_2.ТекстЗапросаВТТребуетсяСформироватьЭтапы();
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТНезавершенныеЗаказы()
	
	ТекстЗапроса = Документы.ЗаказНаПроизводство2_2.ТекстЗапросаВТНезавершенныеЗаказы();
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаИзмененныеСостояния()

	ТекстЗапроса =
		"ВЫБРАТЬ
		|	РеквизитыДокумента.Ссылка             КАК Заказ,
		|
		|	ВЫБОР
		|		КОГДА НЕ ВТСостоянияЭтапов.Ссылка ЕСТЬ NULL И ВТСостоянияЭтапов.СостояниеНаМежцеховомУровне = ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповНаМежцеховомУровне.ТребуетУточнения)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовНаПроизводствоВОчереди.ТребуетсяПроверитьЭтапы)
		|	
		|		КОГДА НЕ ВТТребуетсяСформироватьЭтапы.Ссылка ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовНаПроизводствоВОчереди.ТребуетсяСформироватьЭтапы)
		|	
		|		КОГДА НЕ ВТСостоянияЭтапов.Ссылка ЕСТЬ NULL И ВТСостоянияЭтапов.СостояниеНаМежцеховомУровне = ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповНаМежцеховомУровне.ГотовКВыполнению)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовНаПроизводствоВОчереди.ТребуетсяПередатьЭтапыКВыполнению)
		|	
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовНаПроизводствоВОчереди.ПустаяСсылка)
		|
		|	КОНЕЦ                                 КАК СостояниеЭтапов,
		|
		|	ВЫБОР
		|		КОГДА НЕ ВТСостоянияЭтапов.Ссылка ЕСТЬ NULL И ВТСостоянияЭтапов.ТребуетОбеспечения
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовНаПроизводствоВОчереди.ТребуетсяОбеспечение)
		|		
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовНаПроизводствоВОчереди.ПустаяСсылка)
		|
		|	КОНЕЦ                                 КАК СостояниеОбеспечения,
		|
		|	ВЫБОР
		|		КОГДА РеквизитыДокумента.ТипПроизводственногоПроцесса В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Сборка),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Ремонт),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.БезСпецификаций)) ТОГДА
		|
		|			ВЫБОР
		|				КОГДА ВТНезавершенныеЗаказы.Ссылка ЕСТЬ NULL
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовНаПроизводствоВОчереди.Выполнен)
		|
		|				КОГДА &ИспользуетсяГрафикПроизводства
		|						И РеквизитыДокумента.ДатаПотребности <> ДАТАВРЕМЯ(1,1,1)
		|						И ИСТИНА В
		|							(ВЫБРАТЬ ПЕРВЫЕ 1
		|								ИСТИНА
		|							ИЗ
		|								РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК График
		|							ГДЕ
		|								График.ОкончаниеЭтапа  > РеквизитыДокумента.ДатаПотребности
		|								И График.Распоряжение  = РеквизитыДокумента.Ссылка
		|								И График.СтатусГрафика = &СтатусРабочийГрафик)
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовНаПроизводствоВОчереди.НарушенаДатаПотребности)
		|
		|				ИНАЧЕ
		|					ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовНаПроизводствоВОчереди.ПустаяСсылка)
		|				КОНЕЦ
		|
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовНаПроизводствоВОчереди.ПустаяСсылка)
		|
		|	КОНЕЦ                                 КАК СостояниеВыпуска,
		|
		|	ВЫБОР
		|		КОГДА РеквизитыДокумента.Проведен
		|				И РеквизитыДокумента.Статус = &СтатусКПроизводству
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|	КОНЕЦ                                 КАК АктивныйСтатус
		|
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2 КАК РеквизитыДокумента
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостоянияЭтапов КАК ВТСостоянияЭтапов
		|		ПО ВТСостоянияЭтапов.Ссылка = РеквизитыДокумента.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТребуетсяСформироватьЭтапы КАК ВТТребуетсяСформироватьЭтапы
		|		ПО ВТТребуетсяСформироватьЭтапы.Ссылка = РеквизитыДокумента.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНезавершенныеЗаказы КАК ВТНезавершенныеЗаказы
		|		ПО ВТНезавершенныеЗаказы.Ссылка = РеквизитыДокумента.Ссылка
		|
		|ГДЕ 
		|	РеквизитыДокумента.Ссылка В (&МассивСсылок)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВыборкаИзменений(МассивСсылок)
	
	ТекстыЗапроса = Новый Массив();
	
	ТекстЗапроса = ТекстЗапросаВТСостоянияЭтапов();
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТТребуетсяСформироватьЭтапы();
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТНезавершенныеЗаказы();
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаИзмененныеСостояния();
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = УправлениеПроизводством.ОбъединитьТекстыЗапросаВПакет(ТекстыЗапроса);
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Запрос.УстановитьПараметр("СтатусКПроизводству", Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству);
	
	Запрос.УстановитьПараметр("СтатусРабочийГрафик", РегистрыСведений.ГрафикЭтаповПроизводства2_2.СтатусРабочийГрафик());
	Запрос.УстановитьПараметр("ИспользуетсяГрафикПроизводства", УправлениеПроизводствомПовтИсп.ИспользуетсяГрафикПроизводства());
	Запрос.УстановитьПараметр("ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров", Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить());
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ЗаписатьСостояния(Выборка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.СостоянияЗаказовНаПроизводство.СоздатьНаборЗаписей();
		Набор.Отбор.Заказ.Установить(Выборка.Заказ);
		
		ДобавитьЗаписьВНабор(Выборка, Набор);
	
		Попытка
			
			Набор.Записать(Истина);
			
		Исключение
			
			ТекстСообщения = НСтр("ru = 'Не удалось отразить состояние заказа по причине: %Причина%';
									|en = 'Cannot record state of order. Reason: %Причина%'");
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			СобытиеЖурналаРегистрации = СобытиеЖурналаРегистрации();
			
			ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Предупреждение,
				Выборка.Заказ.Метаданные(), Выборка.Заказ, ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецФункции

Процедура ДобавитьЗаписьВНабор(Выборка, Набор)
	
	Если Выборка.АктивныйСтатус
		И (Не Выборка.СостояниеЭтапов.Пустая()
			ИЛИ Не Выборка.СостояниеОбеспечения.Пустая()
			ИЛИ Не Выборка.СостояниеВыпуска.Пустая()
		) Тогда
		ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
	КонецЕсли;

КонецПроцедуры

Функция СобытиеЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Межцеховое управление';
				|en = 'Production scheduling and controlling'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()) + "."
			+ НСтр("ru = 'Ошибка отражения состояния заказов в очереди';
					|en = 'Error recording order states in the queue'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
